import {LevelFormat} from "../src/Interfaces";

export const TestLevel3: LevelFormat = {
    levelId: "3",
    width: 9,
    height: 12,
    targetScore: 15,
    upAllowance: 11,
    dialogue: [
        {text: "興味がない\nの？\n\nなぜみんな\n死んでいた", face: "CONFUSED"},
        {text: "私のせい\nじゃないよ", face: "UPSET"},
        {text: "だから、\n\nただ\nパソコン\nだよ.", face: "NORMAL"},
        {text: "みんなを\n殺されて、\nどうやって\nだろう？", face: "HAPPY"},
    ],
    contents: {
        grid: [
            [0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 2, 0],
            [0, 0, 0, 0, 0, 0, 0, 3, 0],
            [0, 0, 2, 0, 0, 0, 0, 4, 0],
            [0, 4, 3, 0, 0, 0, 0, 3, 0],
            [2, 2, 2, 2, 3, 0, 0, 1, 0],
            [3, 1, 2, 3, 4, 2, 3, 1, 3],
            [4, 3, 1, 1, 3, 2, 4, 2, 4],
            [3, 1, 2, 3, 1, 3, 1, 2, 2],
        ]
    },
    goals: [
        [2, 0],
        [2, 0],
        [1, 2],
        [1, 0],
        [4, 3],
        [3, 0],
        [1, 2],
        [2, 0],
        [4, 1],
        [3, 4],
        [3, 0],
        [0, 0],
    ]
};
