import {LevelFormat} from "../src/Interfaces";

export const TestLevel4: LevelFormat = {
    levelId: "4",
    width: 12,
    height: 12,
    targetScore: 37,
    upAllowance: 10,
    dialogue: [
        {text: "まあ、\nそのお話は\n必要がない\nですね？", face: "HAPPY"},
        {text: "だから…", face: "NORMAL"},
        {text: "あんたは…", face: "NORMAL"},
        {text: "私の友達に\nなった\nでしょ\n\n\\(^.^)/", face: "HAPPY"}
    ],
    contents: {
        grid: [
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 2, 0, 0, 0, 0, 0, 2, 0, 0, 0],
            [0, 0, 4, 0, 0, 0, 0, 0, 3, 0, 0, 0],
            [0, 0, 2, 0, 0, 0, 0, 0, 4, 1, 0, 0],
            [0, 2, 3, 1, 0, 0, 0, 0, 3, 4, 1, 0],
            [4, 4, 4, 2, 0, 0, 0, 0, 1, 1, 1, 1],
            [2, 3, 2, 3, 0, 0, 3, 1, 3, 3, 3, 3],
            [1, 1, 1, 4, 3, 2, 4, 2, 4, 4, 4, 4],
            [3, 2, 1, 4, 1, 3, 1, 2, 2, 2, 2, 2],
        ]
    },
    goals: [
        [2, 0],
        [2, 0],
        [1, 2],
        [1, 0],
        [4, 2],
        [3, 1],
        [3, 2],
        [2, 3],
        [4, 0],
        [2, 3],
        [1, 0],
        [0, 2],
    ]
};
