import {LevelFormat} from "../src/Interfaces";

export const TestLevel5: LevelFormat = {
    levelId: "5",
    width: 14,
    height: 12,
    targetScore: 46,
    upAllowance: 10,
    dialogue: [
        {text: "何ですか？\n\nもう\n止まりたい\nですか？", face: "CONFUSED"},
        {text: "でも…\nなぜだろう\n!!!!!!", face: "UPSET"},
        {text: "あんた…\n\nまだ\n殺されない\nから、なぜ\n?????", face: "UPSET"},
        {text: "いいえ…\nいいえいい\nえいいえい\nいえいいえ\nいいえーー", face: "BLINK_2"},
        {text: "あんたは…", face: "NORMAL"},
        {text: "私の友達\nだよ\n\n:):):):)", face: "HAPPY"},
    ],
    contents: {
        grid: [
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 4, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0],
            [0, 0, 3, 0, 0, 0, 0, 0, 4, 4, 0, 4, 0, 0],
            [0, 4, 2, 1, 0, 0, 0, 0, 1, 1, 0, 4, 0, 0],
            [0, 3, 2, 4, 0, 0, 0, 0, 2, 3, 0, 3, 0, 0],
            [0, 2, 4, 3, 1, 1, 2, 0, 1, 2, 2, 2, 1, 0],
            [2, 2, 4, 3, 1, 1, 1, 0, 1, 2, 1, 3, 2, 1],
            [4, 4, 1, 4, 4, 1, 1, 2, 4, 1, 2, 1, 2, 1],
            [2, 4, 3, 4, 2, 3, 2, 2, 4, 2, 1, 2, 2, 1],
            [2, 1, 2, 4, 2, 3, 3, 1, 3, 4, 3, 4, 4, 1]
        ]
    },
    goals: [
        [3, 1],
        [3, 0],
        [2, 3],
        [1, 0],
        [4, 0],
        [3, 0],
        [1, 2],
        [4, 0],
        [1, 0],
        [2, 3],
        [3, 2],
        [1, 0]
    ]
};
